### 🌊 Neptune Apply Results

**Terraform Stacks:** `apps/web, apps/web/ci-102-1, apps/web/ci-102-2`

**Neptune completed the apply with status:** ✅
> For more details, see the [GitHub Actions run](https://github.com/devopsfactory-io/neptune-tests/actions/runs/23525945222)

**Command ✅** `terragrunt apply -auto-approve` (stack: apps/web)
<details>
<summary>Click to see the command output</summary>

```
stderr:
[apps/web] 05:11:17.972 INFO   Downloading Terraform configurations from ../../_modules/null-stack into ./.terragrunt-cache/6P9tidISWBB3QzlNzQtu-E3IDNE/wXSEdkNd5e5MY27MFN0bjqcoO98
05:11:18.178 INFO   tofu: Initializing the backend...
05:11:18.291 INFO   tofu: 
05:11:18.291 INFO   tofu: Successfully configured the backend "s3"! OpenTofu will automatically
05:11:18.292 INFO   tofu: use this backend unless the backend configuration changes.
05:11:18.365 INFO   tofu: Initializing provider plugins...
05:11:18.365 INFO   tofu: - Finding hashicorp/null versions matching "~> 3.0"...
05:11:18.575 INFO   tofu: - Finding hashicorp/local versions matching "~> 2.0"...
05:11:18.648 INFO   tofu: - Installing hashicorp/null v3.2.4...
05:11:18.812 INFO   tofu: - Installed hashicorp/null v3.2.4 (signed, key ID 0C0AF313E5FD9F80)
05:11:18.867 INFO   tofu: - Installing hashicorp/local v2.7.0...
05:11:19.048 INFO   tofu: - Installed hashicorp/local v2.7.0 (signed, key ID 0C0AF313E5FD9F80)
05:11:19.048 INFO   tofu: Providers are signed by their developers.
05:11:19.048 INFO   tofu: If you'd like to know more about provider signing, you can read about it here:
05:11:19.048 INFO   tofu: https://opentofu.org/docs/cli/plugins/signing/
05:11:19.048 INFO   tofu: OpenTofu has created a lock file .terraform.lock.hcl to record the provider
05:11:19.048 INFO   tofu: selections it made above. Include this file in your version control repository
05:11:19.048 INFO   tofu: so that OpenTofu can guarantee to make the same selections by default when
05:11:19.049 INFO   tofu: you run "tofu init" in the future.
05:11:19.049 INFO   tofu: OpenTofu has been successfully initialized!
05:11:19.049 INFO   tofu: 
05:11:19.049 INFO   tofu: You may now begin working with OpenTofu. Try running "tofu plan" to see
05:11:19.049 INFO   tofu: any changes that are required for your infrastructure. All OpenTofu commands
05:11:19.049 INFO   tofu: should now work.
05:11:19.049 INFO   tofu: If you ever set or change modules or backend configuration for OpenTofu,
05:11:19.049 INFO   tofu: rerun this command to reinitialize your working directory. If you forget, other
05:11:19.049 INFO   tofu: commands will detect it and remind you to do so if necessary.

stdout:
[apps/web] 05:11:19.541 STDOUT tofu: null_resource.stack: Refreshing state... [id=5873597553842205034]
05:11:19.541 STDOUT tofu: local_file.output: Refreshing state... [id=02b8a7d21d6e858cd56b387b18a7f09886438742]
05:11:19.550 STDOUT tofu: OpenTofu used the selected providers to generate the following execution
05:11:19.550 STDOUT tofu: plan. Resource actions are indicated with the following symbols:
05:11:19.551 STDOUT tofu:   + create
05:11:19.551 STDOUT tofu: OpenTofu will perform the following actions:
05:11:19.551 STDOUT tofu:   # local_file.output will be created
05:11:19.551 STDOUT tofu:   + resource "local_file" "output" {
05:11:19.551 STDOUT tofu:       + content              = "apps/web deployed"
05:11:19.551 STDOUT tofu:       + content_base64sha256 = (known after apply)
05:11:19.551 STDOUT tofu:       + content_base64sha512 = (known after apply)
05:11:19.551 STDOUT tofu:       + content_md5          = (known after apply)
05:11:19.551 STDOUT tofu:       + content_sha1         = (known after apply)
05:11:19.551 STDOUT tofu:       + content_sha256       = (known after apply)
05:11:19.551 STDOUT tofu:       + content_sha512       = (known after apply)
05:11:19.551 STDOUT tofu:       + directory_permission = "0777"
05:11:19.551 STDOUT tofu:       + file_permission      = "0777"
05:11:19.551 STDOUT tofu:       + filename             = "./output.txt"
05:11:19.551 STDOUT tofu:       + id                   = (known after apply)
05:11:19.551 STDOUT tofu:     }
05:11:19.551 STDOUT tofu: Plan: 1 to add, 0 to change, 0 to destroy.
05:11:19.551 STDOUT tofu: 
05:11:19.592 STDOUT tofu: local_file.output: Creating...
05:11:19.595 STDOUT tofu: local_file.output: Creation complete after 0s [id=02b8a7d21d6e858cd56b387b18a7f09886438742]
05:11:19.597 STDOUT tofu: 
05:11:19.597 STDOUT tofu: Apply complete! Resources: 1 added, 0 changed, 0 destroyed.
05:11:19.597 STDOUT tofu: 
```

</details>

**Command ✅** `terragrunt apply -auto-approve` (stack: apps/web/ci-102-1)
<details>
<summary>Click to see the command output</summary>

```
stderr:
[apps/web/ci-102-1] 05:11:19.909 INFO   Downloading Terraform configurations from ../../../_modules/null-stack into ./.terragrunt-cache/LjDMVE2jnA-r4KEPw1_3gHdJxtE/wXSEdkNd5e5MY27MFN0bjqcoO98
05:11:20.058 INFO   tofu: Initializing the backend...
05:11:20.170 INFO   tofu: 
05:11:20.170 INFO   tofu: Successfully configured the backend "s3"! OpenTofu will automatically
05:11:20.170 INFO   tofu: use this backend unless the backend configuration changes.
05:11:20.241 INFO   tofu: Initializing provider plugins...
05:11:20.241 INFO   tofu: - Finding hashicorp/null versions matching "~> 3.0"...
05:11:20.304 INFO   tofu: - Finding hashicorp/local versions matching "~> 2.0"...
05:11:20.379 INFO   tofu: - Installing hashicorp/null v3.2.4...
05:11:20.542 INFO   tofu: - Installed hashicorp/null v3.2.4 (signed, key ID 0C0AF313E5FD9F80)
05:11:20.587 INFO   tofu: - Installing hashicorp/local v2.7.0...
05:11:20.766 INFO   tofu: - Installed hashicorp/local v2.7.0 (signed, key ID 0C0AF313E5FD9F80)
05:11:20.766 INFO   tofu: Providers are signed by their developers.
05:11:20.766 INFO   tofu: If you'd like to know more about provider signing, you can read about it here:
05:11:20.766 INFO   tofu: https://opentofu.org/docs/cli/plugins/signing/
05:11:20.766 INFO   tofu: OpenTofu has created a lock file .terraform.lock.hcl to record the provider
05:11:20.766 INFO   tofu: selections it made above. Include this file in your version control repository
05:11:20.767 INFO   tofu: so that OpenTofu can guarantee to make the same selections by default when
05:11:20.767 INFO   tofu: you run "tofu init" in the future.
05:11:20.767 INFO   tofu: OpenTofu has been successfully initialized!
05:11:20.767 INFO   tofu: 
05:11:20.767 INFO   tofu: You may now begin working with OpenTofu. Try running "tofu plan" to see
05:11:20.767 INFO   tofu: any changes that are required for your infrastructure. All OpenTofu commands
05:11:20.767 INFO   tofu: should now work.
05:11:20.767 INFO   tofu: If you ever set or change modules or backend configuration for OpenTofu,
05:11:20.767 INFO   tofu: rerun this command to reinitialize your working directory. If you forget, other
05:11:20.767 INFO   tofu: commands will detect it and remind you to do so if necessary.

stdout:
[apps/web/ci-102-1] 05:11:21.246 STDOUT tofu: null_resource.stack: Refreshing state... [id=513367671554999496]
05:11:21.246 STDOUT tofu: local_file.output: Refreshing state... [id=1f4f63dac9cb80d65f6be29552c2cb03b26900f6]
05:11:21.255 STDOUT tofu: OpenTofu used the selected providers to generate the following execution
05:11:21.256 STDOUT tofu: plan. Resource actions are indicated with the following symbols:
05:11:21.256 STDOUT tofu:   + create
05:11:21.256 STDOUT tofu: OpenTofu will perform the following actions:
05:11:21.256 STDOUT tofu:   # local_file.output will be created
05:11:21.256 STDOUT tofu:   + resource "local_file" "output" {
05:11:21.256 STDOUT tofu:       + content              = "apps/web/ci-102-1 deployed"
05:11:21.256 STDOUT tofu:       + content_base64sha256 = (known after apply)
05:11:21.256 STDOUT tofu:       + content_base64sha512 = (known after apply)
05:11:21.256 STDOUT tofu:       + content_md5          = (known after apply)
05:11:21.257 STDOUT tofu:       + content_sha1         = (known after apply)
05:11:21.257 STDOUT tofu:       + content_sha256       = (known after apply)
05:11:21.257 STDOUT tofu:       + content_sha512       = (known after apply)
05:11:21.257 STDOUT tofu:       + directory_permission = "0777"
05:11:21.257 STDOUT tofu:       + file_permission      = "0777"
05:11:21.257 STDOUT tofu:       + filename             = "./output.txt"
05:11:21.257 STDOUT tofu:       + id                   = (known after apply)
05:11:21.257 STDOUT tofu:     }
05:11:21.257 STDOUT tofu: Plan: 1 to add, 0 to change, 0 to destroy.
05:11:21.257 STDOUT tofu: 
05:11:21.296 STDOUT tofu: local_file.output: Creating...
05:11:21.298 STDOUT tofu: local_file.output: Creation complete after 0s [id=1f4f63dac9cb80d65f6be29552c2cb03b26900f6]
05:11:21.300 STDOUT tofu: 
05:11:21.300 STDOUT tofu: Apply complete! Resources: 1 added, 0 changed, 0 destroyed.
05:11:21.300 STDOUT tofu: 
```

</details>

**Command ✅** `terragrunt apply -auto-approve` (stack: apps/web/ci-102-2)
<details>
<summary>Click to see the command output</summary>

```
stderr:
[apps/web/ci-102-2] 05:11:21.611 INFO   Downloading Terraform configurations from ../../../_modules/null-stack into ./.terragrunt-cache/Yc3gcfg0bxbyefOz0IsZf6F6epE/wXSEdkNd5e5MY27MFN0bjqcoO98
05:11:21.769 INFO   tofu: Initializing the backend...
05:11:21.868 INFO   tofu: 
05:11:21.868 INFO   tofu: Successfully configured the backend "s3"! OpenTofu will automatically
05:11:21.868 INFO   tofu: use this backend unless the backend configuration changes.
05:11:21.944 INFO   tofu: Initializing provider plugins...
05:11:21.944 INFO   tofu: - Finding hashicorp/local versions matching "~> 2.0"...
05:11:21.981 INFO   tofu: - Finding hashicorp/null versions matching "~> 3.0"...
05:11:22.053 INFO   tofu: - Installing hashicorp/local v2.7.0...
05:11:22.238 INFO   tofu: - Installed hashicorp/local v2.7.0 (signed, key ID 0C0AF313E5FD9F80)
05:11:22.285 INFO   tofu: - Installing hashicorp/null v3.2.4...
05:11:22.450 INFO   tofu: - Installed hashicorp/null v3.2.4 (signed, key ID 0C0AF313E5FD9F80)
05:11:22.450 INFO   tofu: Providers are signed by their developers.
05:11:22.450 INFO   tofu: If you'd like to know more about provider signing, you can read about it here:
05:11:22.450 INFO   tofu: https://opentofu.org/docs/cli/plugins/signing/
05:11:22.450 INFO   tofu: OpenTofu has created a lock file .terraform.lock.hcl to record the provider
05:11:22.450 INFO   tofu: selections it made above. Include this file in your version control repository
05:11:22.450 INFO   tofu: so that OpenTofu can guarantee to make the same selections by default when
05:11:22.450 INFO   tofu: you run "tofu init" in the future.
05:11:22.450 INFO   tofu: OpenTofu has been successfully initialized!
05:11:22.450 INFO   tofu: 
05:11:22.450 INFO   tofu: You may now begin working with OpenTofu. Try running "tofu plan" to see
05:11:22.450 INFO   tofu: any changes that are required for your infrastructure. All OpenTofu commands
05:11:22.450 INFO   tofu: should now work.
05:11:22.450 INFO   tofu: If you ever set or change modules or backend configuration for OpenTofu,
05:11:22.451 INFO   tofu: rerun this command to reinitialize your working directory. If you forget, other
05:11:22.451 INFO   tofu: commands will detect it and remind you to do so if necessary.

stdout:
[apps/web/ci-102-2] 05:11:22.924 STDOUT tofu: local_file.output: Refreshing state... [id=bfc4796fd7ff08067e32d6c4b5782340cd83abe5]
05:11:22.925 STDOUT tofu: null_resource.stack: Refreshing state... [id=2217601692384182174]
05:11:22.933 STDOUT tofu: OpenTofu used the selected providers to generate the following execution
05:11:22.933 STDOUT tofu: plan. Resource actions are indicated with the following symbols:
05:11:22.933 STDOUT tofu:   + create
05:11:22.933 STDOUT tofu: OpenTofu will perform the following actions:
05:11:22.933 STDOUT tofu:   # local_file.output will be created
05:11:22.934 STDOUT tofu:   + resource "local_file" "output" {
05:11:22.934 STDOUT tofu:       + content              = "apps/web/ci-102-2 deployed"
05:11:22.934 STDOUT tofu:       + content_base64sha256 = (known after apply)
05:11:22.934 STDOUT tofu:       + content_base64sha512 = (known after apply)
05:11:22.934 STDOUT tofu:       + content_md5          = (known after apply)
05:11:22.934 STDOUT tofu:       + content_sha1         = (known after apply)
05:11:22.934 STDOUT tofu:       + content_sha256       = (known after apply)
05:11:22.934 STDOUT tofu:       + content_sha512       = (known after apply)
05:11:22.934 STDOUT tofu:       + directory_permission = "0777"
05:11:22.934 STDOUT tofu:       + file_permission      = "0777"
05:11:22.935 STDOUT tofu:       + filename             = "./output.txt"
05:11:22.935 STDOUT tofu:       + id                   = (known after apply)
05:11:22.935 STDOUT tofu:     }
05:11:22.935 STDOUT tofu: Plan: 1 to add, 0 to change, 0 to destroy.
05:11:22.935 STDOUT tofu: 
05:11:22.973 STDOUT tofu: local_file.output: Creating...
05:11:22.975 STDOUT tofu: local_file.output: Creation complete after 0s [id=bfc4796fd7ff08067e32d6c4b5782340cd83abe5]
05:11:22.977 STDOUT tofu: 
05:11:22.977 STDOUT tofu: Apply complete! Resources: 1 added, 0 changed, 0 destroyed.
05:11:22.977 STDOUT tofu: 
```

</details>



Automatically merging because all changed stacks have been successfully applied.
